In [2]:
import pandas as pd
import numpy as np
pd.set_option('display.max_rows',500)
pd.set_option('display.max_columns',500)
pd.set_option('display.width',1000)
import matplotlib.pyplot as plt
from numpy import set_printoptions
from pandas import read_csv

In [3]:
header_names=['PID','Survived','Pclass','Name','Gender','Age','SibSp','Parch','Ticket','Fare','Cabin','Embarked']
titanic = pd.read_csv('titanic.csv',names=header_names)

In [4]:
titanic

     PID  Survived  Pclass                                               Name  Gender   Age  SibSp  Parch            Ticket     Fare Cabin Embarked
0      1         0       3                            Braund, Mr. Owen Harris    male  22.0      1      0         A/5 21171   7.2500   NaN        S
1      2         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1      0          PC 17599  71.2833   C85        C
2      3         1       3                             Heikkinen, Miss. Laina  female  26.0      0      0  STON/O2. 3101282   7.9250   NaN        S
3      4         1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1      0            113803  53.1000  C123        S
4      5         0       3                           Allen, Mr. William Henry    male  35.0      0      0            373450   8.0500   NaN        S
..   ...       ...     ...                                                ...     ...   ...    ...    ...               ...      ...   ...      ...
886  887         0       2                              Montvila, Rev. Juozas    male  27.0      0      0            211536  13.0000   NaN        S
887  888         1       1                       Graham, Miss. Margaret Edith  female  19.0      0      0            112053  30.0000   B42        S
888  889         0       3           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1      2        W./C. 6607  23.4500   NaN        S
889  890         1       1                              Behr, Mr. Karl Howell    male  26.0      0      0            111369  30.0000  C148        C
890  891         0       3                                Dooley, Mr. Patrick    male  32.0      0      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]

In [9]:
titanic.pivot_table('Survived', index='Gender', columns='Pclass')

Pclass         1         2         3
Gender
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447